## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.prisma_migration_handler will be created
  + resource "aws_cloudwatch_log_group" "prisma_migration_handler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Prisma_Migration_Handler"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id               = "arn:aws:iam::687401027353:policy/lambda_s3"
        name             = "lambda_s3"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (3 unchanged elements hidden)
                            "arn:aws:s3:::forms-staging-reliability-file-storage",
                          + "arn:aws:s3:::forms-staging-prisma-migration-storage/*",
                          + "arn:aws:s3:::forms-staging-prisma-migration-storage",
                            "arn:aws:s3:::forms-staging-audit-logs-archive-storage/*",
                            # (3 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Error: Invalid index

  on prisma_migration.tf line 3, in resource "aws_lambda_function" "prisma_migration":
   3:   image_uri     = "${var.ecr_repository_lambda_urls["prisma-migration-lambda"]}:latest"
    ├────────────────
    │ var.ecr_repository_lambda_urls is map of string with 13 elements

The given key does not identify an element in this collection value.
[0;90m13:16:15.051[0m [0;31mERROR [0m terraform invocation failed in ./.terragrunt-cache/ADB5PbtBRAnr3uwNv0kZMaQEidU/-syjFrdAaB-6kNXhMmF1nXBOp7o/lambdas
[0;90m13:16:15.051[0m [0;31mERROR [0m error occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in ./.terragrunt-cache/ADB5PbtBRAnr3uwNv0kZMaQEidU/-syjFrdAaB-6kNXhMmF1nXBOp7o/lambdas
  
  Error: Invalid index
  
    on prisma_migration.tf line 3, in resource "aws_lambda_function" "prisma_migration":
     3:   image_uri     = "${var.ecr_repository_lambda_urls["prisma-migration-lambda"]}:latest"
      ├────────────────
      │ var.ecr_repository_lambda_urls is map of string with 13 elements
  
  The given key does not identify an element in this collection value.
  
  exit status 1


```

</details>

